<a href="https://colab.research.google.com/github/themanoftalent/pyt-colab/blob/master/sqlalchemey.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [6]:
veri = pd.DataFrame(np.random.randint(low=1,high=100,size=(20,5)),columns=['a','b','c','d','e'])

In [ ]:
veri

In [8]:
damper = create_engine('sqlite:///:memory:')

In [9]:
veriyos = veri.to_sql('yeni_masa',con=damper)

In [12]:
veriyospd =pd.read_sql(sql='yeni_masa',con=damper)

In [13]:
veriyospd

    index   a   b   c   d   e
0       0  62  32  92  11  34
1       1  42  68  25  32   3
2       2   5  77  44  45  96
3       3  97  40  71  89  86
4       4  51  92  49   2  36
5       5  76  29  34  11   9
6       6  95  44  39  64   9
7       7  45  33  77  93  68
8       8  51  64  80  69  60
9       9  18  12   7  67  54
10     10  98  71  41  80  97
11     11  47  42   6  68  28
12     12  87   3  69   6  24
13     13  51  13  43  94  85
14     14  84  58  62  48  74
15     15  57  31  12  72  71
16     16  84  11  79  17  28
17     17  96  19   1  31  88
18     18  65  23  88  46  33
19     19  47  25  30  53  45

In [10]:
from sqlalchemy import create_engine

In [11]:
temp_db = create_engine('sqlite:///:memory:')

In [13]:
df=pd.DataFrame(np.random.randint(0,100,size=(4,4)),columns=['a','b','c','d'])

In [14]:
df

    a   b   c   d
0  36  30  42  68
1  78  81  11  35
2  50  51  78  59
3  68  73   7  45

In [16]:
df.to_sql(name='new_table',con=temp_db)

In [17]:
new_df= pd.read_sql(sql='new_table',con=temp_db)

In [18]:
new_df

   index   a   b   c   d
0      0  36  30  42  68
1      1  78  81  11  35
2      2  50  51  78  59
3      3  68  73   7  45

In [20]:
pd.read_sql_query(sql='SELECT a,c FROM new_table',con=temp_db)

    a   c
0  36  42
1  78  11
2  50  78
3  68   7

In [22]:
d_result= pd.read_sql_query(sql='Select d FROM new_table',con=temp_db)

In [23]:
d_result

    d
0  68
1  35
2  59
3  45

In [34]:
temper = create_engine('sqlite:///:memory:')

In [36]:
defdata=pd.DataFrame(np.linspace(1,100,2))

In [37]:
a_t = defdata.to_sql(name='a_table',con=temper)

In [38]:
a_t

In [39]:
read_at = pd.read_sql(sql='a_table',con=temper)

In [40]:
read_at

   index      0
0      0    1.0
1      1  100.0